semestre_i/aag/aula_um/segunda_atividade.tex
% Created 2018-08-21 Tue 18:19
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Gustavo de Paula\\ \texttt{\href{mailto:gustavodepaula@disroot.org}{gustavodepaula@disroot.org}}}
\input{structure.tex}
\usepackage[portuguese, ]{babel}
\date{\today}
\title{AAG: Questões, Aula \#1.2}
\hypersetup{
 pdfauthor={Gustavo de Paula},
 pdftitle={AAG: Questões, Aula \#1.2},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.1.13)}, 
 pdflang={Breton}}
\begin{document}

\maketitle
\tableofcontents


\section{Fábrica de Software}
\label{sec:org1457263}
Assumiremos aqui que fábrica de software é uma organização, empresa, ou
semelhante que possui um time de desenvolvimento, metodologias e processos e
onde o produto principal é o software em si ou onde o software é o
protagonista do serviço ofertado.

\section{Taylorismo}
\label{sec:orgd8ce42a}
Taylor, desenvolveu um conjunto de métodos que aperfeiçoavam o processo de
divisão técnica do trabalho, sendo que o conhecimento do processo produtivo era
de responsabilidade única do gerente. Uma das maiores características do sistema
taylorista é a remuneração. Antes os funcionários tinham um incentivo negativo:
a motivação era baseada no medo de serem dispensados. Com Taylor, o incentivo
passou a ser positivo: ele propôs o pagamento por peça. Sendo assim, quanto
maior a produtividade da organização, mais o trabalhador ganharia

\section{Fordismo}
\label{sec:org19aa231}
Fordismo é um modo de produção que faz uso do sistema de linha de produção para
atingir três objetivos principais: intensificação (dinamismo do tempo de
produção), economia (manutenção da produção equilibrada com seus estoques),
produtividade (extrair o máximo da mão de obra de cada trabalhador).

\section{Metodologias de desenvolvimento de software}
\label{sec:org2f16c1d}
Há varias metodologias de desenvolvimento de software, os mais relevantes hoje
são divididos nas seguintes categorias:
\subsection{Iterativas (ágeis)}
\label{sec:org5ad4a59}
As metodologias de desenvolvimento ágil são aquelas que fazem usos de iterações
ou \emph{sprints}. Cada iteração dura de uma a quatro semanas. Em uma sprint, o time
passa por todas as fases de desenvolvimento (análises, design, programação e
teste) e no final, o resultado é apresentado à stakeholders e clientes que podem
dar feedback antes do sistema como todo estar pronto.
\subsection{Cascata (waterfall)}
\label{sec:org64b1a54}
As metodologias de desenvolvimento em cascata são aquelas onde o desenvolvimento
é feito linearmente separados em várias fases, com pouca flexibilidade e
iteração. As fases de um desenvolvimento em cascata costumam ser divididas nas
seguintes fases:
\begin{itemize}
\item Documentação dos requerimentos do produto
\item Análise, onde modelos e regras de negócios são resultados
\item Design, onde a arquitetura do software é feita
\item Programação, onde o desenvolvimento é feito
\item Teste, onde há o descobrimento e conserto de bugs
\item Operação, onde há a instalação, suporte e manutenção do sistema
\end{itemize}

\section{Análise Comparativa}
\label{sec:org0a3c100}
A metodologia de cascata é a que mais se aproxima das metodologias
tayloristas/fordistas, sendo adotada muitas vezes por grandes empresas com uma
cultura corporativa mais "aflorada". Nessa metodologia, há uma grande
especialização dos trabalhadores de cada fase, possuindo uma grande rigidez e
pouca autonomia para o time desenvolvimento.
Já as metodologias ágeis são as que mais se afastam dos sistemas
fordistas/tayloristas, onde há certa especialização entre os trabalhadores,
porém de um modo diferente. Onde no sistema de cascata há pessoas diferentes
para cada fase, nas metodologias ágeis, o time todo é envolvido em todas as
fases, e dentro de cada fase, há uma certa especialização (e.g.
Frontend/Backend). Nas metodologias ágeis há pouca rigidez e grande autonomia
dos times de desenvolvimento.
\end{document}
